import { Box } from "@mui/material";
import { Container } from "@mui/system";
import React from "react";

//About Page

const About = () => {
  return (
    <div>
      <Box
        style={{
          width: "100%",
          height: "150px",
          backgroundColor: "blue",
          marginBottom: "50px",
          color: "white",
          textAlign: "center",
          paddingTop: "50px",
        }}
      >
        <h1>আমরা যা চাই</h1>
      </Box>

      <Container maxWidth="lg">
        <div
          style={{
            color: "gray",
            lineHeight: "2",
            paddingTop: "15px",
            paddingBottom: "50px",
          }}
        >
          <p>
            বিয়ে জটিল এবং ধীর একটি প্রক্রিয়া । আমাদের আশেপাশে নিজের চাহিদা বা
            যোগ্যতা সম্মত জীবনসঙ্গী খোঁজতে খোঁজতে দেখা যায় জীবন থেকে অনেক
            গুরুত্বপূর্ণ সময় হারিয়ে যাই । এটার অন্যতম কারণ হচ্ছে চাহিদামত
            জীবনসঙ্গীর খোঁজ না পাওয়া । সচরাচর যত প্রপোজাল আসে সব রিলেটিভ
            কেন্দ্রিক।অনেক সময় রিলেটিভদের বেখেয়ালি কিংবা শত্রুতাবশত প্রপোজাল
            একসময় বন্ধ হয়ে যায় । এইক্ষেত্রে মেয়ের অভিভাবকরা চরম দুশ্চিন্তাগ্রস্ত
            হয়ে পড়ে আর মেয়েটাও মারাত্মক ডিপ্রেশনে পড়ে যায় ।
          </p>
          <p>মাঝেমাঝে একটা দুইটা আসলেও দেখা যায় চাহিদামত একেবারেই হচ্ছেনা।</p>
          <p>
            আমাদের গ্রামীণ অঞ্চলের মেয়েদের বিয়ে দেরীতে হওয়ার অন্যতম কারন হচ্ছে
            শত্রুতা । প্রস্তাবগুলো ঘরপর্যন্ত আর যাওয়া হয়ে উঠেনা । আর ছেলেদের
            ক্ষেত্রে দেখা যায় বন্ধু বান্ধব আর আত্মীয় স্বজনকে মেয়ে দেখিয়ে দেওয়ার
            জন্যে বলতে বলতে একসময় বিরক্ত হয়ে যায় । পরবর্তীতে আর কাউকে বলা হয়ে
            উঠেনা । সবাই নিজ নিজ কাজে ব্যস্ত । কার উপকারে আর কে এগিয়ে আসবে !
          </p>
          <p>
            এইসব কিছু দূরে ফেলে এই ক্ষেত্রে আপনারা আমাদের এই প্লাটফর্ম ব্যবহার
            করতে পারবেন । আপনার চাহিদা মত জীবনসঙ্গী পেয়ে যাবেন আমাদের এই
            প্লাটফর্মে । আমরা শুধু চাই বিয়ের মত একটি গুরুত্বপূর্ণ ইবাদত যেন জটিল
            না হয়, একেবারে সহজ হয়ে যাক ।
          </p>
          <p>
            বিয়ে কোন লজ্জা বা সংকোচের বিষয় নয় । বিয়ে একটি গুরুত্বপূর্ণ অধ্যায় ।
            বিয়ের জন্যে উভয় পক্ষকে আগাতে হবে । চেষ্টা করতে হবে । এই চেষ্ঠার
            প্রতিফল হচ্ছে এই ওয়েবসাইট ।
          </p>
          <p>সকলে মনের মত জীবনসঙ্গী যেন পায় সেই কামনা করি । </p>
        </div>
      </Container>
    </div>
  );
};

export default About;
